GitConverter/src/Catalogs/ВерсииХранилища/ВерсииХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииХранилища</name>
  <owners>Catalog.ХранилищаКонфигураций</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозниклаОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженыТолькоИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>CatalogRef.ОчередиВыполнения</types>
      <types>CatalogRef.КопииХранилищКонфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПолнаяВыгрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GitConverter/src/Enums/СостоянияВерсии/СостоянияВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВерсии</name>
  <enumValues>
    <name>ПолучаетсяCF</name>
  </enumValues>
  <enumValues>
    <name>ПолученCF</name>
  </enumValues>
  <enumValues>
    <name>ВыгружаетсяВXML</name>
  </enumValues>
  <enumValues>
    <name>ВыгруженаВXML</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяВEDT</name>
  </enumValues>
  <enumValues>
    <name>ЗагруженаВEDT</name>
  </enumValues>
  <enumValues>
    <name>ПомещаетсяВGit</name>
  </enumValues>
  <enumValues>
    <name>ПомещенаВGit</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Catalogs/ВерсииХранилища/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыВерсии(ВерсияХранилища) Экспорт
	Запрос = ЗапросПоЭлементам(Новый Структура("Ссылка", ВерсияХранилища), , 1);
	Если Не ЗначениеЗаполнено(ВерсияХранилища) Тогда
		Возврат ОбщегоНазначения.СтруктураПоТекстуЗапроса(Запрос.Текст);
	КонецЕсли;
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 0 Тогда
		Таблица.Добавить();
	КонецЕсли;
	Структура = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Таблица[0]);
	Возврат Структура;
КонецФункции

// Возвращает структуру последней версии хранилища.
//
// Параметры:
//   Хранилище - СправочникСсылка.ХранилищаКонфигураций
//
// Возвращаемое значение:
//   Структура
//       * Версия - Число - Код последней версии.
//       * Ссылка - СправочникСсылка.ВерсииХранилища - Ссылка последней версии.
//
Функция ПоследняяВерсияХранилища(Знач Хранилище) Экспорт
	Результат = Новый Структура("Код, Ссылка", 0, Справочники.ВерсииХранилища.ПустаяСсылка());
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииХранилища.Ссылка КАК Ссылка,
	|	ВерсииХранилища.Код КАК Код
	|ИЗ
	|	Справочник.ВерсииХранилища КАК ВерсииХранилища
	|ГДЕ
	|	ВерсииХранилища.Владелец = &Хранилище
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Загрузить версию отчета из файла
// 
// Параметры:
// 	Хранилище - СправочникСсылка.ХранилищаКонфигураций - ссылка на хранилище
// 	ИмяФайлаОтчета - Строка - Имя файла отчета
Процедура ЗагрузитьВерсииИзОтчета(Знач Хранилище, ИмяФайлаОтчета) Экспорт 
	
	Файл = Новый Файл(ИмяФайлаОтчета);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Отчет = Новый  ТабличныйДокумент;
	Отчет.Прочитать(ИмяФайлаОтчета);
	
	ВерсииХранилища = Новый Массив;
	
	ПоляВерсии = Новый Соответствие;
	ПоляВерсии.Вставить("Версия:", "Версия");
	ПоляВерсии.Вставить("Дата создания:", "ДатаСоздания");
	ПоляВерсии.Вставить("Время создания:", "ВремяСоздания");
	ПоляВерсии.Вставить("Пользователь:", "Пользователь");
	ПоляВерсии.Вставить("Комментарий:", "Комментарий");
	ПоляВерсии.Вставить("Добавлены:", "Добавлены");
	ПоляВерсии.Вставить("Изменены:", "Изменены");
	ПоляВерсии.Вставить("Удалены:", "Удалены");
	ПоляВерсии.Вставить("Version:", "Версия");
	ПоляВерсии.Вставить("Creation date:", "ДатаСоздания");
	ПоляВерсии.Вставить("Creation time:", "ВремяСоздания");
	ПоляВерсии.Вставить("User:", "Пользователь");
	ПоляВерсии.Вставить("Comment:", "Комментарий");
	ПоляВерсии.Вставить("Added:", "Добавлены");
	ПоляВерсии.Вставить("Changed:", "Изменены");
	ПоляВерсии.Вставить("Deleted:", "Удалены");
	
	КолонкаПоиска = Отчет.Область("C1");
	ОбластьСтроки = Неопределено;
	ОбластьСтроки = Отчет.НайтиТекст("Версия:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
	Если ОбластьСтроки = Неопределено Тогда
		ОбластьСтроки = Отчет.НайтиТекст("Version:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
	КонецЕсли;
	Пока ОбластьСтроки <> Неопределено Цикл
		
		ВерсияХранилища = Новый Структура("Версия, ДатаСоздания, ВремяСоздания, Пользователь, Комментарий, Добавлены, Изменены, Удалены", "", "", "", "", "", Новый Массив, Новый Массив, Новый Массив);
		
		СтрокаНачалаВерсии = ОбластьСтроки.Верх;
		ОбластьСтрокиНаРусском = Отчет.НайтиТекст("Версия:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
		Если ОбластьСтрокиНаРусском = Неопределено Тогда
			ОбластьСтроки = Отчет.НайтиТекст("Version:", ОбластьСтроки, КолонкаПоиска, Ложь, Истина, Истина, Истина);
		Иначе
			ОбластьСтроки = ОбластьСтрокиНаРусском;
		КонецЕсли;
		Если ОбластьСтроки = Неопределено Тогда
			
			// Это последняя версия в файле, получаем конец документа
			СтрокаОкончанияВерсии = Отчет.ВысотаТаблицы;
		
		Иначе
		
			СтрокаОкончанияВерсии = ОбластьСтроки.Верх-1;
		
		КонецЕсли; 
		
		ИмяТекущегоМассиваСтрок = "";
		
		Пока СтрокаНачалаВерсии <= СтрокаОкончанияВерсии Цикл
			
			Имя = "R"+Формат(СтрокаНачалаВерсии, "ЧДЦ=; ЧГ=0") + "C1";
			Ключ = ПоляВерсии.Получить(Отчет.Область(Имя).Текст);
			Имя = "R"+Формат(СтрокаНачалаВерсии, "ЧДЦ=; ЧГ=0") + "C2";
			Значение = Отчет.Область(Имя).Текст;
			Если ЗначениеЗаполнено(Значение) Тогда
				Если Ключ = Неопределено Тогда
					
					Если ЗначениеЗаполнено(ИмяТекущегоМассиваСтрок) И ЗначениеЗаполнено(Значение) Тогда
						ВерсияХранилища[ИмяТекущегоМассиваСтрок].Добавить(Значение);
					КонецЕсли; 
				Иначе
					Если ТипЗнч(ВерсияХранилища[Ключ]) = Тип("Массив") Тогда
						ИмяТекущегоМассиваСтрок = Ключ;
						ВерсияХранилища[ИмяТекущегоМассиваСтрок].Добавить(Значение);
					Иначе
						ВерсияХранилища[Ключ] = Значение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			
			СтрокаНачалаВерсии = СтрокаНачалаВерсии + 1;
		
		КонецЦикла; 
		
		ВерсииХранилища.Добавить(ВерсияХранилища);
		
	КонецЦикла;
	
	// Сохраняем версии
	Если ВерсииХранилища.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Если в отчете есть пустые пользователи - не загружаем
	Для Каждого ВерсияХранилища Из ВерсииХранилища Цикл
		Если Не ЗначениеЗаполнено(ВерсияХранилища.Пользователь) Тогда

			ЗаписьЖурналаРегистрации(НСтр("ru = 'Некорректный отчет из хранилища'", Метаданные.ОсновнойЯзык.КодЯзыка), 
			                         УровеньЖурналаРегистрации.Ошибка,
			                         ,
			                         ,
			                         ЗначениеВСтрокуВнутр(Отчет));						
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	МассивКодов = Новый Массив;
	Для каждого ВерсияХранилища Из ВерсииХранилища Цикл
		Версия = Число(ВерсияХранилища.Версия);
		Если Версия = 0 Тогда
			Продолжить;
		КонецЕсли; 
		МассивКодов.Добавить(Версия);
	
	КонецЦикла;
	
	Если МассивКодов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ВерсииХранилища");
		ЭлементБлокировки.УстановитьЗначение("Владелец", Хранилище);
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииХранилища.Ссылка,
		|	ВерсииХранилища.Код
		|ИЗ
		|	Справочник.ВерсииХранилища КАК ВерсииХранилища
		|ГДЕ
		|	ВерсииХранилища.Владелец = &Хранилище
		|	И ВерсииХранилища.Код В(&Коды)";
		
		Запрос.УстановитьПараметр("Коды", МассивКодов);
		Запрос.УстановитьПараметр("Хранилище", Хранилище);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаВерсий = РезультатЗапроса.Выгрузить();
		ТаблицаВерсий.Индексы.Добавить("Код");
		
		Для каждого ВерсияХранилища Из ВерсииХранилища Цикл
			Версия = Число(ВерсияХранилища.Версия);
			Если Версия = 0 Тогда
				Продолжить;
			КонецЕсли; 
			НайденнаяСтрока = ТаблицаВерсий.Найти(Версия, "Код");
			Если НайденнаяСтрока = Неопределено Тогда
				
				Объект = Справочники.ВерсииХранилища.СоздатьЭлемент();
				
			Иначе
				
				Объект = НайденнаяСтрока.Ссылка.ПолучитьОбъект();
				Объект.ЗначенияРеквизитовДоЗаписи(Ложь); // Кэширование значений "до записи" сразу после чтения из СУБД.
				
			КонецЕсли; 
			
			Объект.Владелец = Хранилище;
			Объект.Код = Версия;
			
			Попытка
				ВремяСоздания = СтрЗаменить(ВерсияХранилища.ВремяСоздания, ":", "");
				Если СтрДлина(ВремяСоздания) = 5 Тогда
					ВремяСоздания = "0" + ВремяСоздания;
				КонецЕсли; 
				Объект.ДатаСоздания = Дата(Прав(СокрЛП(ВерсияХранилища.ДатаСоздания), 4) + Сред(ВерсияХранилища.ДатаСоздания,4,2) + Лев(ВерсияХранилища.ДатаСоздания, 2) + ВремяСоздания);
			Исключение
				
			КонецПопытки; 
			
			Объект.Пользователь = ВерсияХранилища.Пользователь;
			Объект.Комментарий  = ВерсияХранилища.Комментарий;
			
			Объект.Состав.Очистить();
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Добавлены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Добавлено";
				НоваяСтрока.ОбъектМетаданных = ОбъектМетаданных;
				
			КонецЦикла;
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Изменены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Изменено";
				НоваяСтрока.ОбъектМетаданных = ОбъектМетаданных;
				
			КонецЦикла;
			Для каждого ОбъектМетаданных Из ВерсияХранилища.Удалены Цикл
				
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.Тип = "Удалено";
				НоваяСтрока.ОбъектМетаданных = ОбъектМетаданных;
				
			КонецЦикла;
			Объект.Записать();
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка версий хранилища конфигурации'", Метаданные.ОсновнойЯзык.КодЯзыка),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ХранилищаКонфигураций,
			Хранилище,
			ТекстОшибки);
			
		ВызватьИсключение ТекстОшибки;
	КонецПопытки; 
	
КонецПроцедуры

// Фиксирует ошибку обработки версии хранилища.
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Версия хранилища.
//   Ошибка - Строка, ИнформацияОбОшибке - Ошибка.
//
Функция ВозниклаОшибка(Знач ВерсияХранилища, Знач Ошибка) Экспорт
	НачатьТранзакцию();
	ВерсияОбъект = ЗаблокироватьИПолучитьОбъект(ВерсияХранилища);
	Если ВерсияОбъект = Неопределено Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	Если ВерсияОбъект.ВозниклаОшибка
		И ВерсияОбъект.КоличествоОшибок > КонвертацияХранилища.МаксимальноеКоличествоОшибокВерсии() Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	ВерсияОбъект.ВозниклаОшибка = Истина;
	ВерсияОбъект.КоличествоОшибок = ВерсияОбъект.КоличествоОшибок + 1;
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = Строка(Ошибка);
	КонецЕсли;
	ВерсияОбъект.ТекстОшибки =
		Лев(
			Формат(ВерсияОбъект.КоличествоОшибок, "ЧГ=")
			+ ". "
			+ ТекстОшибки
			+ Символы.ПС
			+ Символы.ПС
			+ ВерсияОбъект.ТекстОшибки,
			25000);
	
	ВерсияОбъект.ДополнительныеСвойства.Вставить("ОчищатьКаталогВерсииВТекущемСеансе", Ложь);
	ВерсияОбъект.Записать();
	ЗафиксироватьТранзакцию();
	
	// После этого регламентным заданием ОчисткаОтМусора вызывается процедура СброситьОшибку (см. ниже).
	
	Возврат Истина;
КонецФункции

// Устанавливает новое состояние для версии хранилища.
//
// Параметры:
//   ВерсияХранилища - СправочникСсылка.ВерсииХранилища - Ссылка на версию.
//   ПараметрыВерсии - Неопределено, Структура, СтрокаТаблицыЗначений
//       - См. Справочники.ВерсииХранилища.ПараметрыВерсии или КонвертацияХранилища.КонтекстРаботыСВерсией.
//   ОжидаемоеСостояние - ПеречислениеСсылка.СостоянияВерсии -
//       Значение реквизита Состояние которое ожидается у объекта после получения его из базы данных.
//       Если состояние отличается от ожидаемого, то транзакция отменяется и возвращется Ложь.
//   СостояниеВПроцессе - ПеречислениеСсылка.СостоянияВерсии -
//       Значение реквизита Состояние которое будет установлено версии на период обработки.
//   ЗначенияРеквизитов - Неопределено, Структура - 
//       Дополнительные значения реквизитов, которые необходимо изменить у версии.
//
// Возвращаемое значение:
//   Булево - Истина, если удалось начать обработку версии, Ложь - если не удалось.
//
Функция НачатьОбработкуВерсии(Знач ВерсияХранилища, ПараметрыВерсии, Знач ОжидаемоеСостояние, Знач СостояниеВПроцессе, Знач ЗначенияРеквизитов = Неопределено) Экспорт
	Если ПараметрыВерсии <> Неопределено
		И ПараметрыВерсии.Состояние <> ОжидаемоеСостояние Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	ВерсияОбъект = ЗаблокироватьИПолучитьОбъект(ВерсияХранилища);
	Если ВерсияОбъект = Неопределено
		Или ВерсияОбъект.ВозниклаОшибка
		Или ВерсияОбъект.Состояние <> ОжидаемоеСостояние Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	ВерсияОбъект.ДатаНачалаОбработкиСостояния = ТекущаяДата();
	ВерсияОбъект.Состояние = СостояниеВПроцессе;
	Если ЗначенияРеквизитов <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
			ВерсияОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение; // Явно проверяется наличие реквизита.
		КонецЦикла;
	КонецЕсли;
	ВерсияОбъект.Записать();
	ЗафиксироватьТранзакцию();
	
	Если ПараметрыВерсии <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыВерсии, ВерсияОбъект);
		Если ТипЗнч(ПараметрыВерсии) = Тип("Структура") И ПараметрыВерсии.Свойство("ИмяФайлаЛога") Тогда
			КонвертацияХранилища.ДополнитьКонтекстРаботыСВерсией(ПараметрыВерсии);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

// Устанавливает новые значения реквизитов.
Функция УстановитьЗначенияРеквизитов(Знач ВерсияХранилища, Знач ЗначенияРеквизитов, Знач ОчищатьКаталогВерсииВТекущемСеансе = Ложь) Экспорт
	НачатьТранзакцию();
	ВерсияОбъект = ЗаблокироватьИПолучитьОбъект(ВерсияХранилища);
	Если ВерсияОбъект = Неопределено Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	ЕстьИзменения = Ложь;
	Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл // Явно проверяется наличие реквизита.
		Если ВерсияОбъект[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
			ЕстьИзменения = Истина;
			ВерсияОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьИзменения Или ОчищатьКаталогВерсииВТекущемСеансе Тогда
		ВерсияОбъект.ДополнительныеСвойства.Вставить("ОчищатьКаталогВерсииВТекущемСеансе", ОчищатьКаталогВерсииВТекущемСеансе);
		ВерсияОбъект.Записать();
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	Возврат Истина;
КонецФункции

Функция ЗаблокироватьИПолучитьОбъект(ВерсияХранилища)
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ВерсииХранилища");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ВерсияХранилища);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ВерсияОбъект = ВерсияХранилища.ПолучитьОбъект();
		ВерсияОбъект.ЗначенияРеквизитовДоЗаписи(Ложь); // Кэширование значений "до записи" сразу после чтения из СУБД.
		Возврат ВерсияОбъект;
	Исключение
		Подробно = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Блокировка версии для изменения'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.ВерсииХранилища,
			ВерсияХранилища,
			Подробно);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось заблокировать версию %1 для изменения:%2'"),
			ВерсияХранилища,
			Символы.ПС + Подробно);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция СостоянияПодготавливаемыхВерсий(Знач ПараметрыХранилища) Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", ПараметрыХранилища.Ссылка);
	Отбор.Вставить("ПерваяВерсия", ПараметрыХранилища.ПерваяВерсия);
	Отбор.Вставить("ПоследняяВерсия", ПараметрыХранилища.ПоследняяВерсия);
	Отбор.Вставить("ПомещенаВGit", Ложь);
	
	Запрос = ЗапросПоЭлементам(Отбор, "Код", ПараметрыХранилища.МаксимальноеКоличествоПодготавливаемыхВерсий);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Возвращает запрос по справочнику по указанному отборы и параметрам.
Функция ЗапросПоЭлементам(Отбор, ПоляУпорядочивания = "Код", КоличествоПервых = 10) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.Код КАК Код,
	|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
	|	Таблица.Владелец КАК Владелец,
	|	Таблица.ВозниклаОшибка КАК ВозниклаОшибка,
	|	Таблица.ВыгрузкаИзменений КАК ВыгрузкаИзменений,
	|	Таблица.ДатаНачалаОбработкиСостояния КАК ДатаНачалаОбработкиСостояния,
	|	Таблица.ДатаСоздания КАК ДатаСоздания,
	|	Таблица.Источник КАК Источник,
	|	Таблица.КаталогВременныхФайлов КАК КаталогВременныхФайлов,
	|	Таблица.КоличествоМетаданных КАК КоличествоМетаданных,
	|	Таблица.КоличествоОшибок КАК КоличествоОшибок,
	|	Таблица.Комментарий КАК Комментарий,
	|	Таблица.Пользователь КАК Пользователь,
	|	Таблица.Состояние КАК Состояние,
	|	Таблица.ТребуетсяПолнаяВыгрузка КАК ТребуетсяПолнаяВыгрузка,
	|	Таблица.Хеш КАК Хеш
	|ПОМЕСТИТЬ ОтобранныеВерсии
	|ИЗ
	|	Справочник.ВерсииХранилища КАК Таблица
	|ГДЕ
	|	&ФрагментыУсловий
	|
	|УПОРЯДОЧИТЬ ПО
	|	&ПоляУпорядочивания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтобранныеВерсии.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Изменения.Тип ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			КОГДА Изменения.Тип В (&ТипыДопускающиеВыгрузкуИзменений)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке
	|ПОМЕСТИТЬ ИнформацияОСоставе
	|ИЗ
	|	ОтобранныеВерсии КАК ОтобранныеВерсии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииХранилища.Состав КАК Изменения
	|		ПО ОтобранныеВерсии.Ссылка = Изменения.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтобранныеВерсии.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтобранныеВерсии.Ссылка КАК Ссылка,
	|	ОтобранныеВерсии.Код КАК Код,
	|	ОтобранныеВерсии.ПометкаУдаления КАК ПометкаУдаления,
	|	ОтобранныеВерсии.Владелец КАК Владелец,
	|	ОтобранныеВерсии.ВозниклаОшибка КАК ВозниклаОшибка,
	|	ОтобранныеВерсии.ВыгрузкаИзменений КАК ВыгрузкаИзменений,
	|	ОтобранныеВерсии.ДатаНачалаОбработкиСостояния КАК ДатаНачалаОбработкиСостояния,
	|	ОтобранныеВерсии.ДатаСоздания КАК ДатаСоздания,
	|	ОтобранныеВерсии.Источник КАК Источник,
	|	ОтобранныеВерсии.КаталогВременныхФайлов КАК КаталогВременныхФайлов,
	|	ОтобранныеВерсии.КоличествоМетаданных КАК КоличествоМетаданных,
	|	ОтобранныеВерсии.КоличествоОшибок КАК КоличествоОшибок,
	|	ОтобранныеВерсии.Комментарий КАК Комментарий,
	|	ОтобранныеВерсии.Пользователь КАК Пользователь,
	|	ОтобранныеВерсии.Состояние КАК Состояние,
	|	ОтобранныеВерсии.ТребуетсяПолнаяВыгрузка КАК ТребуетсяПолнаяВыгрузка,
	|	ОтобранныеВерсии.Хеш КАК Хеш,
	|	ИнформацияОСоставе.ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке КАК ЕстьИзмененияПрепятствующиеИнкрементальнойВыгрузке
	|ИЗ
	|	ОтобранныеВерсии КАК ОтобранныеВерсии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИнформацияОСоставе КАК ИнформацияОСоставе
	|		ПО ОтобранныеВерсии.Ссылка = ИнформацияОСоставе.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	&ПоляУпорядочивания";
	
	Запрос.УстановитьПараметр("ТипыДопускающиеВыгрузкуИзменений", 
		ОбщегоНазначенияКлиентСервер.МассивЗначений("Изменено", "Добавлено"));
	
	Если КоличествоПервых > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоПервых, "ЧГ="));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ");
	КонецЕсли;
	
	// Отборы.
	ФрагментыУсловий = Новый Массив;
	Для Каждого КлючИЗначение Из Отбор Цикл
		ИмяРеквизита = КлючИЗначение.Ключ;
		ЗначениеОтбора = КлючИЗначение.Значение;
		
		Если ИмяРеквизита = "ПерваяВерсия" Тогда
			Если ЗначениеОтбора > 0 Тогда
				ФрагментыУсловий.Добавить("Таблица.Код > &ПерваяВерсия");
				Запрос.УстановитьПараметр("ПерваяВерсия", ЗначениеОтбора);
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "ПоследняяВерсия" Тогда
			Если ЗначениеОтбора > 0 Тогда
				ФрагментыУсловий.Добавить("Таблица.Код <= &ПоследняяВерсия");
				Запрос.УстановитьПараметр("ПоследняяВерсия", ЗначениеОтбора);
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "ПомещенаВGit" Тогда
			Если ЗначениеОтбора Тогда
				ФрагментыУсловий.Добавить("Таблица.Состояние = &СостояниеПомещенаВGitВGit");
			Иначе
				ФрагментыУсловий.Добавить("Таблица.Состояние <> &СостояниеПомещенаВGitВGit");
			КонецЕсли;
			Запрос.УстановитьПараметр("СостояниеПомещенаВGitВGit", Перечисления.СостоянияВерсии.ПомещенаВGit);
			
		ИначеЕсли ИмяРеквизита = "КаталогВременныхФайловУказан" Тогда
			Если ЗначениеОтбора Тогда
				ФрагментыУсловий.Добавить("Таблица.КаталогВременныхФайлов <> """"");
			Иначе
				ФрагментыУсловий.Добавить("Таблица.КаталогВременныхФайлов = """"");
			КонецЕсли;
			
		ИначеЕсли ИмяРеквизита = "ДатаНачалаОбработкиСостоянияМеньшеИлиРавно" Тогда
			ФрагментыУсловий.Добавить("Таблица.ДатаНачалаОбработкиСостояния > &ПустаяДата");
			ФрагментыУсловий.Добавить("Таблица.ДатаНачалаОбработкиСостояния <= &ДатаНачалаОбработкиСостояния");
			Запрос.УстановитьПараметр("ПустаяДата", '00010101');
			Запрос.УстановитьПараметр("ДатаНачалаОбработкиСостояния", ЗначениеОтбора);
			
		ИначеЕсли ИмяРеквизита = "КоличествоОшибокМеньше" Тогда
			ФрагментыУсловий.Добавить("Таблица.КоличествоОшибок < &КоличествоОшибок");
			Запрос.УстановитьПараметр("КоличествоОшибок", ЗначениеОтбора);
			
		Иначе // Стандартный отбор по реквизитам.
			
			// Фиксированный массив преобразуется в обычный.
			Если ТипЗнч(ЗначениеОтбора) = Тип("ФиксированныйМассив") Тогда
				ЗначениеОтбора = Новый Массив(ЗначениеОтбора);
			КонецЕсли;
			// Добавляется отбор.
			Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
				ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 В (&%1)", ИмяРеквизита))
			Иначе
				ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 = &%1", ИмяРеквизита))
			КонецЕсли;
			// Устанавливается значение отбора.
			Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеОтбора);
			
		КонецЕсли;
		
	КонецЦикла;
	Если ФрагментыУсловий.Количество() = 0 Тогда
		ФрагментыУсловий.Добавить("ИСТИНА"); // Выбор всех версий без ограничений выглядит ошибкой.
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФрагментыУсловий", СтрСоединить(ФрагментыУсловий, Символы.ПС + Символы.Таб + Символы.Таб + "И "));
	
	// Порядок.
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляУпорядочивания", ПоляУпорядочивания);
	
	Возврат Запрос;
КонецФункции

#КонецОбласти

#КонецЕсли
